IoThang/pic16f-mplab-xc8/MPLAB/TEMPLATE CODE PIC/HC-SR05_Ultrasonic/code/HC-SR05_Template.X/lcd.c
/**
   LCD driver source file

  Company:
    Microchip Technology Inc.

  File Name:
    lcd.c

  Summary:
    This is the  user  source file which has specific functions for LCD.

  Description:
    This modules includes all service functions for LCD operations.
*/

/*
Copyright (c) 2013 - 2014 released Microchip Technology Inc.  All rights reserved.

Microchip licenses to you the right to use, modify, copy and distribute
Software only when embedded on a Microchip microcontroller or digital signal
controller that is integrated into your product or third party product
(pursuant to the sublicense terms in the accompanying license agreement).

You should refer to the license agreement accompanying this Software for
additional information regarding your rights and obligations.

SOFTWARE AND DOCUMENTATION ARE PROVIDED "AS IS" WITHOUT WARRANTY OF ANY KIND,
EITHER EXPRESS OR IMPLIED, INCLUDING WITHOUT LIMITATION, ANY WARRANTY OF
MERCHANTABILITY, TITLE, NON-INFRINGEMENT AND FITNESS FOR A PARTICULAR PURPOSE.
IN NO EVENT SHALL MICROCHIP OR ITS LICENSORS BE LIABLE OR OBLIGATED UNDER
CONTRACT, NEGLIGENCE, STRICT LIABILITY, CONTRIBUTION, BREACH OF WARRANTY, OR
OTHER LEGAL EQUITABLE THEORY ANY DIRECT OR INDIRECT DAMAGES OR EXPENSES
INCLUDING BUT NOT LIMITED TO ANY INCIDENTAL, SPECIAL, INDIRECT, PUNITIVE OR
CONSEQUENTIAL DAMAGES, LOST PROFITS OR LOST DATA, COST OF PROCUREMENT OF
SUBSTITUTE GOODS, TECHNOLOGY, SERVICES, OR ANY CLAIMS BY THIRD PARTIES
(INCLUDING BUT NOT LIMITED TO ANY DEFENSE THEREOF), OR OTHER SIMILAR COSTS.
*/

/**
  Section: Included Files
*/
#include <xc.h>
#include "lcd.h"

void LCD_Initialize()
{    
    // clear latches before enabling TRIS bits
    LCD_REG = 0x00;
    //PORTB = 0x00;
    
    //TRISB =  0x00;  // TRIS = 0 means output mode
    TRISD  =  0x00; 
    ANSEL  = 0x00; // ANSELX = 0 deselects analog mode 
    ANSELH = 0x00;
    
    // power up the LCD
    //LCD_PWR = 1; This line is no use

    // required by display controller to allow power to stabilize
    __delay_ms(LCD_Startup);

    // required by display initialization
    LCDPutCmd(0x32);

    // set interface size, # of lines and font
    LCDPutCmd(FUNCTION_SET);

    // turn on display and sets up cursor
    LCDPutCmd(DISPLAY_SETUP);
    
    DisplayClr();

    // set cursor movement direction
    LCDPutCmd(ENTRY_MODE);

}


void LCDWriteNibble(uint8_t ch,uint8_t rs)
{
    // mask off the nibble to be transmitted (applied for both higher and lower bits)
    ch = (ch & 0xF0);   // ch: XXXXXXXX -> ch: XXXX0000

    // clear the LCD_BUS
    LCD_REG = (LCD_REG & 0x0F); // No change to the RS, RW and E pin
    LCD_DB4 = 0;
    LCD_DB5 = 0;
    LCD_DB6 = 0;
    LCD_DB7 = 0;
    
    // move the nibble onto LCD_BUS
    // Latch to DB7
    if(((ch & 0x80)>>7)==1){
        LCD_DB7 = 1;
    } else{
        LCD_DB7 = 0;
    }
    // Latch to DB6
    if(((ch & 0x40)>>6)==1){
        LCD_DB6 = 1;
    } else{
        LCD_DB6 = 0;
    }
    // Latch to DB5
    if(((ch & 0x20)>>5)==1){
        LCD_DB5 = 1;
    } else{
        LCD_DB5 = 0;
    }
    // Latch to DB4
    if(((ch & 0x10)>>4)==1){
        LCD_DB4 = 1;
    } else{
        LCD_DB4 = 0;
    }
    // You may also use this simplest way:
    // TRISB = ch;

    // set data/instr bit to 0 = insructions; 1 = data
    LCD_RS = rs;

    // RW - set write mode
    LCD_RW = 0;

    // set up enable before writing nibble
    LCD_EN = 1;

    // turn off enable after write of nibble
    LCD_EN = 0;
}

void LCDPutChar(uint8_t ch)
{
    __delay_ms(LCD_delay);

    //Send higher nibble first
    LCDWriteNibble(ch,data);

    //get the lower nibble
    ch = (ch << 4);

    // Now send the low nibble
    LCDWriteNibble(ch,data);
}

    
void LCDPutCmd(uint8_t ch)
{
    __delay_ms(LCD_delay);

    //Send the higher nibble
    LCDWriteNibble(ch,instr);

    //get the lower nibble
    ch = (ch << 4);

    __delay_ms(1);

    //Now send the lower nibble
    LCDWriteNibble(ch,instr);
}

 
void LCDPutStr(const char *str)
{
    uint8_t i=0;
    
    // While string has not been fully traveresed
    while (str[i])
    {
        // Go display current char
        LCDPutChar(str[i++]);
    }
    
}

void LCDGoto(uint8_t pos,uint8_t ln)
{
    // if incorrect line or column
    if ((ln > (NB_LINES-1)) || (pos > (NB_COL-1)))
    {
        // Just do nothing
        return;
    }

    // LCD_Goto command
    LCDPutCmd((ln == 1) ? (0xC0 | pos) : (0x80 | pos));

    // Wait for the LCD to finish
    __delay_ms(LCD_delay);
}
/**
 End of File
*/



